&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого Элемент Из Параметры.ОписаниеКолонок Цикл

		НоваяСтрока = НастройкаСортировки.Добавить();
		НоваяСтрока.Колонка = Элемент.Имя;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)

	СтрокаСортировки = "";

	Для Каждого Элемент Из НастройкаСортировки Цикл

		Если Элемент.НаправлениеСортировки = "Возр" Тогда
			СортировкаПоКолонке = Элемент.Колонка + " Возр";
		ИначеЕсли Элемент.НаправлениеСортировки = "Убыв" Тогда
			СортировкаПоКолонке = Элемент.Колонка + " Убыв";
		Иначе
			СортировкаПоКолонке = "";
		КонецЕсли;

		Если НЕ СортировкаПоКолонке = "" Тогда

			СтрокаСортировки = СтрокаСортировки + ?(СтрокаСортировки = "", "", ",") + СортировкаПоКолонке;

		КонецЕсли;

	КонецЦикла;

	Закрыть(СтрокаСортировки);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();

КонецПроцедуры
