#Область ПрограммныйИнтерфейс 
// Обработки.Консоль.Сохранить(Запрос)

// Сохранить.
// 
// Параметры:
//  Запрос - Запрос - Запрос
// 
// Возвращаемое значение:
//  Булево - Сохранить
Функция Сохранить(Запрос) Экспорт
	
	Попытка
		МЗ = ПараметрыСеанса.Конс_СписокЗапросов.Получить();
	Исключение
		МЗ = Новый Массив;
	КонецПопытки;
	
	МЗ.Добавить(Новый Структура("ТабПараметров, ТекстДляРазбора, ИД", Запрос.Параметры, Запрос.Текст, Прав(ТекущаяУниверсальнаяДатаВМиллисекундах(), 14)));
	ПараметрыСеанса.Конс_СписокЗапросов = Новый ХранилищеЗначения(МЗ);
	
	Возврат Ложь
 
КонецФункции
#КонецОбласти

